bluestore/fourjobs-3disks/randread-4k.out
ceph-fuse-replicated: (g=0): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-fuse-erasure_1: (g=1): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-kern-replicated: (g=2): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
ceph-kern-erasure_1: (g=3): rw=randread, bs=4K-4K/4K-4K/4K-4K, ioengine=libaio, iodepth=32
...
fio-2.16
Starting 16 processes

ceph-fuse-replicated: (groupid=0, jobs=4): err= 0: pid=28365: Thu Mar  1 14:14:54 2018
  read : io=65152KB, bw=1084.9KB/s, iops=271, runt= 60055msec
    slat (msec): min=1, max=102, avg=14.72, stdev= 8.54
    clat (usec): min=13, max=745491, avg=455539.49, stdev=60950.89
     lat (msec): min=7, max=770, avg=470.26, stdev=61.97
    clat percentiles (msec):
     |  1.00th=[  310],  5.00th=[  363], 10.00th=[  388], 20.00th=[  412],
     | 30.00th=[  429], 40.00th=[  441], 50.00th=[  453], 60.00th=[  469],
     | 70.00th=[  482], 80.00th=[  502], 90.00th=[  529], 95.00th=[  553],
     | 99.00th=[  603], 99.50th=[  627], 99.90th=[  685], 99.95th=[  693],
     | 99.99th=[  742]
    bw (KB  /s): min=   10, max=  304, per=16.46%, avg=178.46, stdev=30.33
    lat (usec) : 20=0.02%
    lat (msec) : 10=0.01%, 50=0.05%, 100=0.10%, 250=0.17%, 500=78.53%
    lat (msec) : 750=21.12%
  cpu          : usr=0.22%, sys=0.36%, ctx=16310, majf=0, minf=213
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=99.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=16288/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-fuse-erasure_1: (groupid=1, jobs=4): err= 0: pid=29004: Thu Mar  1 14:14:54 2018
  read : io=37452KB, bw=638967B/s, iops=155, runt= 60020msec
    slat (msec): min=2, max=406, avg=25.61, stdev=16.54
    clat (usec): min=17, max=1474.2K, avg=789630.34, stdev=145226.14
     lat (msec): min=13, max=1495, avg=815.25, stdev=148.31
    clat percentiles (msec):
     |  1.00th=[  445],  5.00th=[  553], 10.00th=[  619], 20.00th=[  693],
     | 30.00th=[  734], 40.00th=[  766], 50.00th=[  799], 60.00th=[  824],
     | 70.00th=[  857], 80.00th=[  889], 90.00th=[  947], 95.00th=[  996],
     | 99.00th=[ 1221], 99.50th=[ 1287], 99.90th=[ 1434], 99.95th=[ 1450],
     | 99.99th=[ 1467]
    bw (KB  /s): min=   12, max=  250, per=20.18%, avg=125.70, stdev=31.43
    lat (usec) : 20=0.03%, 50=0.01%
    lat (msec) : 20=0.02%, 50=0.06%, 100=0.10%, 250=0.25%, 500=1.95%
    lat (msec) : 750=33.46%, 1000=59.54%, 2000=4.57%
  cpu          : usr=0.14%, sys=0.20%, ctx=9387, majf=0, minf=212
  IO depths    : 1=0.1%, 2=0.1%, 4=0.2%, 8=0.3%, 16=0.7%, 32=98.7%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=9363/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-replicated: (groupid=2, jobs=4): err= 0: pid=29614: Thu Mar  1 14:14:54 2018
  read : io=97336KB, bw=1595.1KB/s, iops=398, runt= 60990msec
    slat (usec): min=21, max=1628, avg=149.14, stdev=38.18
    clat (usec): min=565, max=3393.2K, avg=320325.45, stdev=601439.54
     lat (usec): min=731, max=3393.3K, avg=320476.25, stdev=601438.29
    clat percentiles (usec):
     |  1.00th=[  900],  5.00th=[ 5408], 10.00th=[ 8032], 20.00th=[11712],
     | 30.00th=[15296], 40.00th=[21120], 50.00th=[31616], 60.00th=[52992],
     | 70.00th=[126464], 80.00th=[493568], 90.00th=[1220608], 95.00th=[1925120],
     | 99.00th=[2375680], 99.50th=[2506752], 99.90th=[2899968], 99.95th=[3096576],
     | 99.99th=[3325952]
    bw (KB  /s): min=    8, max=  565, per=13.05%, avg=208.11, stdev=75.63
    lat (usec) : 750=0.09%, 1000=2.02%
    lat (msec) : 2=0.96%, 4=0.48%, 10=11.29%, 20=23.31%, 50=20.78%
    lat (msec) : 100=9.19%, 250=6.61%, 500=5.44%, 750=4.59%, 1000=3.02%
    lat (msec) : 2000=8.15%, >=2000=4.07%
  cpu          : usr=0.27%, sys=0.90%, ctx=47867, majf=0, minf=219
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.3%, 32=99.5%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=24334/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32
ceph-kern-erasure_1: (groupid=3, jobs=4): err= 0: pid=30273: Thu Mar  1 14:14:54 2018
  read : io=60296KB, bw=995.90KB/s, iops=248, runt= 60546msec
    slat (usec): min=24, max=1807, avg=164.31, stdev=51.61
    clat (msec): min=1, max=5739, avg=513.76, stdev=899.92
     lat (msec): min=1, max=5739, avg=513.93, stdev=899.92
    clat percentiles (usec):
     |  1.00th=[ 1752],  5.00th=[12608], 10.00th=[19840], 20.00th=[34560],
     | 30.00th=[52992], 40.00th=[78336], 50.00th=[120320], 60.00th=[193536],
     | 70.00th=[370688], 80.00th=[733184], 90.00th=[1744896], 95.00th=[2506752],
     | 99.00th=[4423680], 99.50th=[4816896], 99.90th=[5406720], 99.95th=[5603328],
     | 99.99th=[5734400]
    bw (KB  /s): min=   16, max=  576, per=24.94%, avg=248.11, stdev=87.10
    lat (msec) : 2=1.95%, 4=0.38%, 10=1.37%, 20=6.38%, 50=18.42%
    lat (msec) : 100=17.22%, 250=18.63%, 500=9.63%, 750=6.32%, 1000=4.11%
    lat (msec) : 2000=7.70%, >=2000=7.88%
  cpu          : usr=0.17%, sys=0.65%, ctx=28668, majf=0, minf=213
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.2%, 16=0.4%, 32=99.2%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued    : total=r=15074/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: io=65152KB, aggrb=1084KB/s, minb=1084KB/s, maxb=1084KB/s, mint=60055msec, maxt=60055msec

Run status group 1 (all jobs):
   READ: io=37452KB, aggrb=623KB/s, minb=623KB/s, maxb=623KB/s, mint=60020msec, maxt=60020msec

Run status group 2 (all jobs):
   READ: io=97336KB, aggrb=1595KB/s, minb=1595KB/s, maxb=1595KB/s, mint=60990msec, maxt=60990msec

Run status group 3 (all jobs):
   READ: io=60296KB, aggrb=995KB/s, minb=995KB/s, maxb=995KB/s, mint=60546msec, maxt=60546msec